================================================================================
comment line
================================================================================
//
// 
////////////////////
// this is a comment
int a; // this is another comment
// this is the final comment
// yeah //enforce is cool
--------------------------------------------------------------------------------
(compilation_unit
	(comment_line)
	(comment_line)
	(comment_line)
	(comment_line)
	(decl_variable (type_int) (identifier))
	(comment_line)
	(comment_line)
	(comment_line))

================================================================================
oneline empty comment block
================================================================================
/**/
--------------------------------------------------------------------------------
(compilation_unit (comment_block))

================================================================================
oneline comment block with only whitespaces
================================================================================
/* */
--------------------------------------------------------------------------------
(compilation_unit (comment_block))

================================================================================
oneline comment block with only text
================================================================================
/*enforce*/
--------------------------------------------------------------------------------
(compilation_unit (comment_block))

================================================================================
oneline comment block with pounds
================================================================================
/* ///// */
--------------------------------------------------------------------------------
(compilation_unit (comment_block))

================================================================================
oneline comment block
================================================================================
/* this is a comment block */
--------------------------------------------------------------------------------
(compilation_unit (comment_block))

================================================================================
comment block on multiple lines
================================================================================
/*
this is
a comment
block
*/
--------------------------------------------------------------------------------
(compilation_unit (comment_block))

================================================================================
two comment blocks on one line
================================================================================
/* awf */ /* awfawf */
--------------------------------------------------------------------------------
(compilation_unit (comment_block) (comment_block))

================================================================================
comment block before statement
================================================================================
/*
this is
a comment
block
*/
int a;
--------------------------------------------------------------------------------
(compilation_unit
	(comment_block)
	(decl_variable (type_int) (identifier)))

================================================================================
comment block after statement
================================================================================
int a;
/*
this is
a comment
block
*/
--------------------------------------------------------------------------------
(compilation_unit
	(decl_variable (type_int) (identifier))
	(comment_block))

================================================================================
comment block inline statement
================================================================================
int /* this is a comment block */ a;
--------------------------------------------------------------------------------
(compilation_unit (decl_variable (type_int) (comment_block) (identifier)))

================================================================================
comment block with nested opening tag
================================================================================
int /* you open a comment with the '/*' token. */ a;
--------------------------------------------------------------------------------
(compilation_unit 
	(decl_variable (type_int)
		(comment_block)
		(identifier)))

